// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

Console.Write("Введите число: ");
int num = int.Parse(Console.ReadLine());

int FuncThird(int number)
{
    while (num == num % -100)
    if (num == num)
    {
        break;
    }
}

int res = FuncThird(num);
Console.WriteLine($"{res}");